app/controllers/posts_controller.rb

	def index
		@latest = Post.all.reverse
---
SELECT "posts".* FROM "posts"

	def show
		@post = Post.find_by_id params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		if authorized_user(current_user)
			@post = Post.find_by_id params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id if current_user

		if @post.save
---
INSERT INTO "posts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The First Post"], ["user_id", 1], ["created_at", "2016-07-10 18:55:53.040951"], ["updated_at", "2016-07-10 18:55:53.040951"]]

	def update
		@post = Post.find_by_id params[:id]

		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?