app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 5
---
	def index
		@latest = Post.last(5).reverse